Revit 2026 API

# WireMaterialTypeSetInsert Method

---

Insert the specified wire material type into the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual bool Insert(
	WireMaterialType item
)
```
```vb
Public Overridable Function Insert (
	item As WireMaterialType
) As Boolean
```
```cpp
public:
virtual bool Insert(
	WireMaterialType^ item
)
```
```fsharp
abstract Insert :
        item : WireMaterialType -> bool
override Insert :
        item : WireMaterialType -> bool
```

#### Parameters

item WireMaterialType
    The wire material type to be inserted into the set.

#### Return Value

BooleanReturns whether the wire material type was inserted into the set.

#### Reference

WireMaterialTypeSet Class

Autodesk.Revit.DB.Electrical Namespace